HW9.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ru" xml:lang="ru">
<head>
<!-- 2016-12-06 Tue 12:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ДЗ 9</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Михаил Волхов M3438" />
</head>
<body>
<div id="content">
<h1 class="title">ДЗ 9</h1>
<div id="table-of-contents">
<h2>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Создание таблиц и представлений, заполнение данными</a></li>
<li><a href="#orgheadline2">2. Запросы/функции</a></li>
</ul>
</div>
</div>
<p>
Весь sql-код написан и протестирован на <code>PostgreSQL 9.5.4</code>.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Создание таблиц и представлений, заполнение данными</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">Seats</span>(
    PlaneId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">PRIMARY</span> <span style="color: #8fbfdc;">KEY</span>,
    SeatNum <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>
);

<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">Flights</span>(
  FlightId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">PRIMARY</span> <span style="color: #8fbfdc;">KEY</span>,
  FlightTime <span style="color: #EF5C5F;">timestamp</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
  PlaneId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
  SoldOut <span style="color: #EF5C5F;">boolean</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,

  <span style="color: #FFA070;">FOREIGN</span> <span style="color: #8fbfdc;">KEY</span> (PlaneId) <span style="color: #FFA070;">REFERENCES</span> Seats(PlaneId) <span style="color: #FFA070;">ON</span> <span style="color: #8fbfdc;">DELETE</span> <span style="color: #8fbfdc;">CASCADE</span>
);

<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">Tickets</span>(
    UserId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
    FlightId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
    SeatId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
    Expiration <span style="color: #EF5C5F;">timestamp</span>,
    IsPaid <span style="color: #EF5C5F;">boolean</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">DEFAULT</span> <span style="color: #FFA070;">False</span>,

    <span style="color: #FFA070;">PRIMARY</span> <span style="color: #8fbfdc;">KEY</span> (UserId, FlightId, SeatId),
    <span style="color: #FFA070;">FOREIGN</span> <span style="color: #8fbfdc;">KEY</span> (FlightId) <span style="color: #FFA070;">REFERENCES</span> Flights(FlightId) <span style="color: #FFA070;">ON</span> <span style="color: #8fbfdc;">DELETE</span> <span style="color: #8fbfdc;">CASCADE</span>,
    <span style="color: #FFA070;">UNIQUE</span>(FlightId, SeatId) <span style="color: #637579;">-- &#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1076;&#1072;&#1085;&#1086;/&#1079;&#1072;&#1073;&#1088;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099;</span>
);

<span style="color: #8fbfdc;">DELETE</span> <span style="color: #FFA070;">FROM</span> Seats <span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">True</span>;
<span style="color: #8fbfdc;">INSERT</span> <span style="color: #FFA070;">INTO</span> Seats <span style="color: #8fbfdc;">VALUES</span>
  (111, 10),
  (222, 15),
  (333, 20);

<span style="color: #8fbfdc;">DELETE</span> <span style="color: #FFA070;">FROM</span> Flights <span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">True</span>;
<span style="color: #8fbfdc;">INSERT</span> <span style="color: #FFA070;">INTO</span> Flights <span style="color: #8fbfdc;">VALUES</span>
  (0, <span style="color: #868B44;">'2016-12-06 12:00:00'</span>, 111, <span style="color: #FFA070;">False</span>),
  (1, <span style="color: #868B44;">'2016-12-07 22:00:00'</span>, 222, <span style="color: #FFA070;">False</span>),
  (2, <span style="color: #868B44;">'2016-12-08 06:30:00'</span>, 333, <span style="color: #FFA070;">False</span>),
  (3, <span style="color: #868B44;">'2016-12-07 06:30:00'</span>, 222, <span style="color: #FFA070;">True</span>);

<span style="color: #8fbfdc;">DELETE</span> <span style="color: #FFA070;">FROM</span> Tickets <span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">True</span>;
<span style="color: #8fbfdc;">INSERT</span> <span style="color: #FFA070;">INTO</span> Tickets <span style="color: #8fbfdc;">VALUES</span>
  (0,0,2,<span style="color: #FFA070;">null</span>,<span style="color: #FFA070;">True</span>),
  (1,0,3,<span style="color: #868B44;">'2016-12-06 04:00:00'</span>,<span style="color: #FFA070;">False</span>),
  (2,2,5,<span style="color: #868B44;">'2016-12-06 12:00:00'</span>,<span style="color: #FFA070;">False</span>);

<span style="color: #637579;">-- Flights that we can manipulate tickets for.</span>
<span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">VIEW</span> <span style="color: #8AAFFA;">ValidFlights</span> <span style="color: #FFA070;">AS</span>
<span style="color: #FFA070;">SELECT</span> FlightId, PlaneId <span style="color: #FFA070;">FROM</span> Flights
<span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">NOT</span> SoldOut <span style="color: #FFA070;">AND</span>
      FlightTime - now() &gt; <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'2 hour'</span>;

<span style="color: #637579;">-- (planeId, seatId) for every accessible seat in the plane</span>
<span style="color: #637579;">-- let's suppose there can't be more than 100 seats in plane</span>
<span style="color: #637579;">-- (we can use 1000 instead)</span>
<span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">VIEW</span> <span style="color: #8AAFFA;">AllSeats</span> <span style="color: #FFA070;">AS</span>
<span style="color: #FFA070;">SELECT</span> S.PlaneId, n <span style="color: #FFA070;">AS</span> SeatId
<span style="color: #FFA070;">FROM</span> generate_series(1,100) <span style="color: #FFA070;">AS</span> <span style="color: #8fbfdc;">a</span>(n), Seats <span style="color: #FFA070;">AS</span> S
<span style="color: #FFA070;">WHERE</span> n &lt;= S.SeatNum
<span style="color: #FFA070;">ORDER</span> <span style="color: #8fbfdc;">BY</span> S.PlaneId;

<span style="color: #637579;">-- Valid reservations + sold out seats.</span>
<span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">VIEW</span> <span style="color: #8AAFFA;">NonFreeSeats</span> <span style="color: #FFA070;">AS</span>
<span style="color: #FFA070;">SELECT</span> FlightId, SeatId
<span style="color: #FFA070;">FROM</span> ValidFlights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> Flights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> Tickets
<span style="color: #FFA070;">WHERE</span> IsPaid <span style="color: #FFA070;">OR</span>                         <span style="color: #637579;">-- reedemed tickets</span>
      (Expiration <span style="color: #FFA070;">IS</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">AND</span>       <span style="color: #637579;">-- valid reservations</span>
       now() &lt; Expiration <span style="color: #FFA070;">AND</span>
       Expiration &lt; FlightTime <span style="color: #FFA070;">AND</span>
       FlightTime - now() &gt; <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'1 day'</span>);

<span style="color: #637579;">-- Seats that we can buy (only).</span>
<span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">VIEW</span> <span style="color: #8AAFFA;">PurchaseAvailable</span> <span style="color: #FFA070;">AS</span>
<span style="color: #FFA070;">SELECT</span> FlightId, SeatId
<span style="color: #FFA070;">FROM</span> ValidFlights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> AllSeats
<span style="color: #FFA070;">WHERE</span> (FlightId,SeatId) <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">IN</span> (<span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">from</span> NonFreeSeats);

<span style="color: #637579;">-- Seats that can be bought _and_ reserved. PurchaseAvailable \ those</span>
<span style="color: #637579;">-- that can't be booked.</span>
<span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">VIEW</span> <span style="color: #8AAFFA;">ReservationAvailable</span> <span style="color: #FFA070;">AS</span>
<span style="color: #FFA070;">SELECT</span> FlightId, SeatId
<span style="color: #FFA070;">FROM</span> ValidFlights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> Flights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> AllSeats
<span style="color: #FFA070;">WHERE</span> FlightTime - now() &gt; <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'1 day'</span> <span style="color: #FFA070;">AND</span>
      (FlightId,SeatId) <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">IN</span> (<span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">FROM</span> NonFreeSeats);
</pre>
</div>
</div>
</div>
