HW9.html
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Запросы/функции</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
Список мест, доступных для продажи и бронирования. Есть два
варианта интеретации формулировки:
</p>
<ol class="org-ol">
<li>Доступны для (продажи и бронирования).</li>
<li>Доступны для продажи и доступны для бронирования &#x2013; доступны
для продажи или бронирования.</li>
</ol>
<p>
Вот реализация для (2). Для (1) надо заменить <code>PurchaseAvailable</code>
на <code>ReservationAvailable</code>.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">FUNCTION</span> <span style="color: #8AAFFA;">FreeSeatsAll</span>(fId <span style="color: #EF5C5F;">INT</span>)
  <span style="color: #8fbfdc;">RETURNS</span> <span style="color: #FFA070;">TABLE</span> (chairId <span style="color: #EF5C5F;">INT</span>) <span style="color: #FFA070;">AS</span>
$func$
<span style="color: #8fbfdc;">BEGIN</span>
    <span style="color: #8fbfdc;">RETURN</span> QUERY <span style="color: #FFA070;">SELECT</span> SeatId <span style="color: #FFA070;">FROM</span> PurchaseAvailable <span style="color: #FFA070;">WHERE</span> FlightId = fId;
<span style="color: #FFA070;">END</span>
$func$ <span style="color: #8fbfdc;">LANGUAGE</span> plpgsql;
</pre>
</div></li>
<li><p>
Попытка зарезервировать место.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">FUNCTION</span> <span style="color: #8AAFFA;">Reserve</span>(uId <span style="color: #EF5C5F;">INT</span>, fId <span style="color: #EF5C5F;">INT</span>, sId <span style="color: #EF5C5F;">INT</span>)
  <span style="color: #8fbfdc;">RETURNS</span> <span style="color: #EF5C5F;">boolean</span> <span style="color: #FFA070;">AS</span>
$func$
<span style="color: #8fbfdc;">BEGIN</span>
   <span style="color: #8fbfdc;">INSERT</span> <span style="color: #FFA070;">INTO</span> Tickets (UserId, FlightId, SeatId, Expiration, IsPaid)
     <span style="color: #FFA070;">SELECT</span> uId,fId,sId,now() + <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'1 day'</span>,<span style="color: #FFA070;">FALSE</span>
     <span style="color: #FFA070;">ON</span> CONFLICT (FlightId,SeatId) <span style="color: #FFA070;">DO</span>
       <span style="color: #8fbfdc;">UPDATE</span> <span style="color: #8fbfdc;">SET</span> Expiration = now() + <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'1 day'</span>,
                  UserId = uId
     <span style="color: #FFA070;">WHERE</span> (fId,sId) <span style="color: #FFA070;">IN</span> (<span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">FROM</span> ReservationAvailable);

   <span style="color: #8fbfdc;">IF</span> <span style="color: #8fbfdc;">FOUND</span> <span style="color: #FFA070;">THEN</span> <span style="color: #8fbfdc;">RETURN</span> <span style="color: #FFA070;">TRUE</span>;
   <span style="color: #FFA070;">ELSE</span> <span style="color: #8fbfdc;">RETURN</span> <span style="color: #FFA070;">FALSE</span>;
   <span style="color: #FFA070;">END</span> <span style="color: #8fbfdc;">IF</span>;
<span style="color: #FFA070;">END</span>
$func$ <span style="color: #8fbfdc;">LANGUAGE</span> plpgsql;
</pre>
</div></li>
<li><p>
Продление брони.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">FUNCTION</span> <span style="color: #8AAFFA;">ExtendReservation</span>(fId <span style="color: #EF5C5F;">INT</span>, sId <span style="color: #EF5C5F;">INT</span>)
  <span style="color: #8fbfdc;">RETURNS</span> <span style="color: #EF5C5F;">boolean</span> <span style="color: #FFA070;">AS</span>
$func$
<span style="color: #8fbfdc;">BEGIN</span>
   <span style="color: #8fbfdc;">UPDATE</span> Tickets
   <span style="color: #8fbfdc;">SET</span> Expiration = now() + <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'1 day'</span>
   <span style="color: #FFA070;">WHERE</span>
       FlightId = fId <span style="color: #FFA070;">AND</span>
       SeatId = sId <span style="color: #FFA070;">AND</span>
       IsPaid = <span style="color: #FFA070;">FALSE</span> <span style="color: #FFA070;">AND</span>
       (fId, sId) <span style="color: #FFA070;">in</span> (<span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">FROM</span> NonFreeSeats);

   <span style="color: #8fbfdc;">IF</span> <span style="color: #8fbfdc;">FOUND</span> <span style="color: #FFA070;">THEN</span> <span style="color: #8fbfdc;">RETURN</span> <span style="color: #FFA070;">TRUE</span>;
   <span style="color: #FFA070;">ELSE</span> <span style="color: #8fbfdc;">RETURN</span> <span style="color: #FFA070;">FALSE</span>;
   <span style="color: #FFA070;">END</span> <span style="color: #8fbfdc;">IF</span>;
<span style="color: #FFA070;">END</span>
$func$ <span style="color: #8fbfdc;">LANGUAGE</span> plpgsql;
</pre>
</div></li>
<li><p>
Покупка свободного места.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">FUNCTION</span> <span style="color: #8AAFFA;">BuyFree</span>(uId <span style="color: #EF5C5F;">INT</span>, fId <span style="color: #EF5C5F;">INT</span>, sId <span style="color: #EF5C5F;">INT</span>)
  <span style="color: #8fbfdc;">RETURNS</span> <span style="color: #EF5C5F;">boolean</span> <span style="color: #FFA070;">AS</span>
$func$
<span style="color: #8fbfdc;">BEGIN</span>
   <span style="color: #8fbfdc;">INSERT</span> <span style="color: #FFA070;">INTO</span> Tickets (UserId, FlightId, SeatId, IsPaid)
     <span style="color: #FFA070;">SELECT</span> uId,fId,sId,<span style="color: #FFA070;">TRUE</span>
     <span style="color: #FFA070;">ON</span> CONFLICT (FlightId,SeatId) <span style="color: #FFA070;">DO</span>
       <span style="color: #8fbfdc;">UPDATE</span> <span style="color: #8fbfdc;">SET</span> Expiration = <span style="color: #FFA070;">null</span>
                , UserId = uId
                , IsPaid = <span style="color: #FFA070;">TRUE</span>
     <span style="color: #FFA070;">WHERE</span> (fId,sId) <span style="color: #FFA070;">IN</span> (<span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">FROM</span> FreeSeats);

   <span style="color: #8fbfdc;">IF</span> <span style="color: #8fbfdc;">FOUND</span> <span style="color: #FFA070;">THEN</span> <span style="color: #8fbfdc;">RETURN</span> <span style="color: #FFA070;">TRUE</span>;
   <span style="color: #FFA070;">ELSE</span> <span style="color: #8fbfdc;">RETURN</span> <span style="color: #FFA070;">FALSE</span>;
   <span style="color: #FFA070;">END</span> <span style="color: #8fbfdc;">IF</span>;
<span style="color: #FFA070;">END</span>
$func$ <span style="color: #8fbfdc;">LANGUAGE</span> plpgsql;
</pre>
</div></li>
<li><p>
Покупка зарезервированного места.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">FUNCTION</span> <span style="color: #8AAFFA;">BuyReserved</span>(uId <span style="color: #EF5C5F;">INT</span>, fId <span style="color: #EF5C5F;">INT</span>, sId <span style="color: #EF5C5F;">INT</span>)
  <span style="color: #8fbfdc;">RETURNS</span> <span style="color: #EF5C5F;">boolean</span> <span style="color: #FFA070;">AS</span>
$func$
<span style="color: #8fbfdc;">BEGIN</span>
   <span style="color: #8fbfdc;">UPDATE</span> Tickets
   <span style="color: #8fbfdc;">SET</span> Expiration = <span style="color: #FFA070;">NULL</span>, IsPaid = <span style="color: #FFA070;">TRUE</span>, UserId = uId
   <span style="color: #FFA070;">WHERE</span>
       UserId = uId <span style="color: #FFA070;">AND</span>
       FlightId = fId <span style="color: #FFA070;">AND</span>
       SeatId = sId <span style="color: #FFA070;">AND</span>
       IsPaid = <span style="color: #FFA070;">FALSE</span> <span style="color: #FFA070;">AND</span>
       (fId, sId) <span style="color: #FFA070;">in</span> (<span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">FROM</span> NonFreeSeats);

   <span style="color: #8fbfdc;">IF</span> <span style="color: #8fbfdc;">FOUND</span> <span style="color: #FFA070;">THEN</span> <span style="color: #8fbfdc;">RETURN</span> <span style="color: #FFA070;">TRUE</span>;
   <span style="color: #FFA070;">ELSE</span> <span style="color: #8fbfdc;">RETURN</span> <span style="color: #FFA070;">FALSE</span>;
   <span style="color: #FFA070;">END</span> <span style="color: #8fbfdc;">IF</span>;
<span style="color: #FFA070;">END</span>
$func$ <span style="color: #8fbfdc;">LANGUAGE</span> plpgsql;
</pre>
</div></li>
<li><p>
Статистика по полетам.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">FUNCTION</span> <span style="color: #8AAFFA;">FlightStatistics</span>()
  <span style="color: #8fbfdc;">RETURNS</span> <span style="color: #FFA070;">TABLE</span> ( <span style="color: #8fbfdc;">Id</span> <span style="color: #EF5C5F;">INT</span>
                , Active <span style="color: #EF5C5F;">BOOLEAN</span>
                , FreeN <span style="color: #EF5C5F;">BIGINT</span>
                , ReservedN <span style="color: #EF5C5F;">BIGINT</span>
                , SoldN <span style="color: #EF5C5F;">BIGINT</span>) <span style="color: #FFA070;">AS</span>
$func$
<span style="color: #8fbfdc;">BEGIN</span>
    <span style="color: #8fbfdc;">RETURN</span> QUERY (
        <span style="color: #FFA070;">SELECT</span>
          f.FlightId
          , <span style="color: #FFA070;">NOT</span> f.SoldOut
          , (<span style="color: #FFA070;">SELECT</span> <span style="color: #8fbfdc;">COUNT</span>(*)
             <span style="color: #FFA070;">FROM</span> PurchaseAvailable
             <span style="color: #FFA070;">WHERE</span> FlightId = f.FlightId
             ) <span style="color: #FFA070;">AS</span> FreeN
          , (<span style="color: #FFA070;">SELECT</span> <span style="color: #8fbfdc;">COUNT</span>(*)
             <span style="color: #FFA070;">FROM</span> ValidFlights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> Flights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> Tickets
             <span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">NOT</span> IsPaid <span style="color: #FFA070;">AND</span>
                   (Expiration <span style="color: #FFA070;">IS</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">AND</span>
                    now() &lt; Expiration <span style="color: #FFA070;">AND</span>
                    Expiration &lt; FlightTime) <span style="color: #FFA070;">AND</span>
                   FlightId = f.FlightId
             ) <span style="color: #FFA070;">AS</span> ReservedN
          , (<span style="color: #FFA070;">SELECT</span> <span style="color: #8fbfdc;">COUNT</span>(*)
             <span style="color: #FFA070;">FROM</span> ValidFlights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> Flights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> Tickets
             <span style="color: #FFA070;">WHERE</span> IsPaid <span style="color: #FFA070;">AND</span> FlightId = f.FlightId
             ) <span style="color: #FFA070;">AS</span> SoldN
          <span style="color: #FFA070;">FROM</span> Flights <span style="color: #FFA070;">AS</span> f);
<span style="color: #FFA070;">END</span>
$func$ <span style="color: #8fbfdc;">LANGUAGE</span> plpgsql;
</pre>
</div></li>
<li><p>
Оптимизация занятости мест.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">FUNCTION</span> <span style="color: #8AAFFA;">CompressSeats</span>() <span style="color: #8fbfdc;">RETURNS</span> VOID <span style="color: #FFA070;">AS</span>
$func$
<span style="color: #8fbfdc;">DECLARE</span>
  flight Flights%rowtype;
  ticket Tickets%rowtype;
<span style="color: #637579;">-- https://www.postgresql.org/docs/current/static/plpgsql-structure.html</span>
<span style="color: #637579;">-- Body will run in transaction so we don't need any extra locks</span>
<span style="color: #8fbfdc;">BEGIN</span>
    <span style="color: #FFA070;">FOR</span> flight <span style="color: #FFA070;">IN</span> (<span style="color: #FFA070;">SELECT</span> FlightId <span style="color: #FFA070;">FROM</span> ValidFlights) <span style="color: #FFA070;">LOOP</span>

        <span style="color: #FFA070;">CREATE</span> <span style="color: #8fbfdc;">TEMPORARY</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">TicketsNew</span> (
            UserId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
            FlightId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
            SeatId <span style="color: #EF5C5F;">serial</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
            FormerSeatId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
            Expiration <span style="color: #EF5C5F;">timestamp</span>,
            IsPaid <span style="color: #EF5C5F;">boolean</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">DEFAULT</span> <span style="color: #FFA070;">False</span>,

            <span style="color: #FFA070;">PRIMARY</span> <span style="color: #8fbfdc;">KEY</span> (UserId, FlightId, SeatId),
            <span style="color: #FFA070;">UNIQUE</span>(FlightId, SeatId)
        );
        <span style="color: #637579;">-- start with seat 1 (not that important though)</span>
        <span style="color: #8fbfdc;">ALTER</span> <span style="color: #8fbfdc;">SEQUENCE</span> <span style="color: #8AAFFA;">TicketsNew_seatid_seq</span> <span style="color: #8fbfdc;">RESTART</span> <span style="color: #FFA070;">WITH</span> 1;

        <span style="color: #637579;">-- Aggrgegate all sold tickets</span>
        <span style="color: #FFA070;">FOR</span> ticket
        <span style="color: #FFA070;">IN</span> (<span style="color: #FFA070;">SELECT</span> *
            <span style="color: #FFA070;">FROM</span> Tickets
            <span style="color: #FFA070;">WHERE</span> IsPaid <span style="color: #FFA070;">AND</span> FlightId = flight.FlightId)
        <span style="color: #FFA070;">LOOP</span>
            <span style="color: #8fbfdc;">INSERT</span> <span style="color: #FFA070;">INTO</span> TicketsNew (UserId,FlightId,FormerSeatId,Expiration,IsPaid)
                <span style="color: #8fbfdc;">VALUES</span> (ticket.UserId, ticket.FlightId, ticket.SeatId, ticket.Expiration, ticket.IsPaid);
        <span style="color: #FFA070;">END</span> <span style="color: #FFA070;">LOOP</span>;

        <span style="color: #637579;">-- Aggrgegate all reserved tickets</span>
        <span style="color: #FFA070;">FOR</span> ticket
        <span style="color: #FFA070;">IN</span> (<span style="color: #FFA070;">SELECT</span> *
            <span style="color: #FFA070;">FROM</span> Tickets
            <span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">NOT</span> IsPaid <span style="color: #FFA070;">AND</span>
                  FlightId = flight.FlightId <span style="color: #FFA070;">AND</span>
                  (Expiration <span style="color: #FFA070;">IS</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">AND</span>
                   now() &lt; Expiration <span style="color: #FFA070;">AND</span>
                   Expiration &lt; flight.FlightTime))
        <span style="color: #FFA070;">LOOP</span>
            <span style="color: #8fbfdc;">INSERT</span> <span style="color: #FFA070;">INTO</span> TicketsNew (UserId,FlightId,FormerSeatId,Expiration,IsPaid)
                <span style="color: #8fbfdc;">VALUES</span> (ticket.UserId, ticket.FlightId, ticket.SeatId, ticket.Expiration, ticket.IsPaid);
        <span style="color: #FFA070;">END</span> <span style="color: #FFA070;">LOOP</span>;

        <span style="color: #637579;">-- Remove all tickets from real table that we've added to temp</span>
        <span style="color: #637579;">-- table.</span>
        <span style="color: #8fbfdc;">DELETE</span> <span style="color: #FFA070;">FROM</span> Tickets
        <span style="color: #FFA070;">WHERE</span> (UserId, FlightId, SeatId)
        <span style="color: #FFA070;">IN</span> (<span style="color: #FFA070;">SELECT</span> UserId,FlightId,FormerSeatId <span style="color: #FFA070;">FROM</span> TicketsNew);

        <span style="color: #637579;">-- Put updated data</span>
        <span style="color: #8fbfdc;">INSERT</span> <span style="color: #FFA070;">INTO</span> Tickets
        <span style="color: #FFA070;">SELECT</span> UserId,FlightId,SeatId,Expiration,IsPaid <span style="color: #FFA070;">FROM</span> TicketsNew;

        <span style="color: #8fbfdc;">DROP</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">TicketsNew</span>;
    <span style="color: #FFA070;">END</span> <span style="color: #FFA070;">LOOP</span>;
    <span style="color: #8fbfdc;">RETURN</span>;
<span style="color: #FFA070;">END</span>
$func$ <span style="color: #8fbfdc;">LANGUAGE</span> plpgsql;
</pre>
</div></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#1040;&#1074;&#1090;&#1086;&#1088;: Михаил Волхов M3438</p>
<p class="date">Created: 2016-12-06 Tue 12:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
